Ran Plan for dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `infra_us-east-1_prod_eks_green_kubevela-addons`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.gh-oauth[0] will be created
+   resource "kubectl_manifest" "gh-oauth" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "gh-oauth"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: gh-oauth
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.iohk-ghcr-creds[0] will be created
+   resource "kubectl_manifest" "iohk-ghcr-creds" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "iohk-ghcr-creds"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: iohk-ghcr-creds
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.jwt-signature[0] will be created
+   resource "kubectl_manifest" "jwt-signature" {
+       api_version             = "v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Secret"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "jwt-signature"
+       namespace               = "marlowe"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: jwt-signature
              namespace: marlowe
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/kubevela-addons -w infra_us-east-1_prod_eks_green_kubevela-addons`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Fkubevela-addons%252Finfra_us-east-1_prod_eks_green_kubevela-addons)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/kubevela-addons -w infra_us-east-1_prod_eks_green_kubevela-addons`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`